Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_regdef.h
/** \brief EVR Secondary Under-voltage Monitor Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_EVR_UVMON_Bits B;         /**< \brief Bitfield access */
} Ifx_PMS_EVR_UVMON;

/** \brief EVR Secondary Under-voltage Monitor Register 2   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_EVR_UVMON2_Bits B;        /**< \brief Bitfield access */
} Ifx_PMS_EVR_UVMON2;

/** \brief Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_ID_Bits B;                /**< \brief Bitfield access */
} Ifx_PMS_ID;

/** \brief OCDS Trigger Set Control 0 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_OTSC0_Bits B;             /**< \brief Bitfield access */
} Ifx_PMS_OTSC0;

/** \brief OCDS Trigger Set Control 1 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_OTSC1_Bits B;             /**< \brief Bitfield access */
} Ifx_PMS_OTSC1;

/** \brief OCDS Trigger Set Select Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_OTSS_Bits B;              /**< \brief Bitfield access */
} Ifx_PMS_OTSS;

/** \brief Standby and Wake-up Control Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_PMSW_CR0_Bits B;          /**< \brief Bitfield access */
} Ifx_PMS_PMSW_CR0;

/** \brief Standby and Wake-up Control Register 2   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_PMSW_CR2_Bits B;          /**< \brief Bitfield access */
} Ifx_PMS_PMSW_CR2;

/** \brief Standby and Wake-up Control Register 3   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_PMSW_CR3_Bits B;          /**< \brief Bitfield access */
} Ifx_PMS_PMSW_CR3;

/** \brief Standby and Wake-up Control Register 4   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_PMSW_CR4_Bits B;          /**< \brief Bitfield access */
} Ifx_PMS_PMSW_CR4;

/** \brief Standby and Wake-up Control Register 5   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_PMSW_CR5_Bits B;          /**< \brief Bitfield access */
} Ifx_PMS_PMSW_CR5;

/** \brief Standby and Wake-up Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_PMSW_STAT_Bits B;         /**< \brief Bitfield access */
} Ifx_PMS_PMSW_STAT;

/** \brief Standby and Wake-up Status Register 2   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_PMSW_STAT2_Bits B;        /**< \brief Bitfield access */
} Ifx_PMS_PMSW_STAT2;

/** \brief Standby and Wake-up Status Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_PMSW_STATCLR_Bits B;      /**< \brief Bitfield access */
} Ifx_PMS_PMSW_STATCLR;

/** \brief Standby WUT Counter Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PMS_PMSW_UTCNT_Bits B;        /**< \brief Bitfield access */
} Ifx_PMS_PMSW_UTCNT;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pms_EVR_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief EVR object */
typedef volatile struct _Ifx_PMS_EVR
{
       Ifx_PMS_EVR_STAT                    STAT;                   /**< \brief 0, EVR Status Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_PMS_EVR_ADCSTAT                 ADCSTAT;                /**< \brief 8, EVR Primary ADC Status Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_PMS_EVR_RSTCON                  RSTCON;                 /**< \brief 10, EVR Reset Control Register*/
       Ifx_UReg_8Bit                       reserved_14[4];         /**< \brief 14, \internal Reserved*/
       Ifx_PMS_EVR_RSTSTAT                 RSTSTAT;                /**< \brief 18, EVR Reset Status Register*/
       Ifx_UReg_8Bit                       reserved_1C[4];         /**< \brief 1C, \internal Reserved */
       Ifx_PMS_EVR_TRIM                    TRIM;                   /**< \brief 20, EVR Trim Control Register*/
       Ifx_PMS_EVR_TRIMSTAT                TRIMSTAT;               /**< \brief 24, EVR Trim Status Register*/
       Ifx_UReg_8Bit                       reserved_28[4];         /**< \brief 28, \internal Reserved */
       Ifx_UReg_8Bit                       reserved_2C[8];         /**< \brief 2C, \internal Reserved */
       Ifx_PMS_EVR_MONSTAT1                MONSTAT1;               /**< \brief 34, EVR Secondary ADC Status Register 1*/
       Ifx_PMS_EVR_MONSTAT2                MONSTAT2;               /**< \brief 38, EVR Secondary ADC Status Register 2*/
       Ifx_PMS_EVR_MONCTRL                 MONCTRL;                /**< \brief 3C, EVR Secondary Monitor Control Register*/
       Ifx_UReg_8Bit                       reserved_40[4];         /**< \brief 40, \internal Reserved */
       Ifx_PMS_EVR_MONFILT                 MONFILT;                /**< \brief 44, EVR Secondary Monitor Filter Register*/
       Ifx_PMS_EVR_PMSIEN                  PMSIEN;                 /**< \brief 48, PMS Interrupt Enable Register*/
       Ifx_PMS_EVR_UVMON                   UVMON;                  /**< \brief 4C, EVR Secondary Under-voltage Monitor Register*/
       Ifx_PMS_EVR_OVMON                   OVMON;                  /**< \brief 50, EVR Secondary Over-voltage Monitor Register*/
       Ifx_PMS_EVR_UVMON2                  UVMON2;                 /**< \brief 54, EVR Secondary Under-voltage Monitor Register 2*/
       Ifx_PMS_EVR_OVMON2                  OVMON2;                 /**< \brief 58, EVR Secondary Over-voltage Monitor Register 2*/
       Ifx_PMS_EVR_HSMUVMON                HSMUVMON;               /**< \brief 5C, EVR Primary HSM Under-voltage Monitor Register*/
       Ifx_PMS_EVR_HSMOVMON                HSMOVMON;               /**< \brief 60, EVR Primary HSM Over-voltage Monitor Register*/
       Ifx_UReg_8Bit                       reserved_64[8];         /**< \brief 64, \internal Reserved */
       Ifx_PMS_EVR_ANACTRL                 ANACTRL;                /**< \brief 6C, EVR Analog Control Register*/
       Ifx_PMS_EVR_BGOCTRL                 BGOCTRL;                /**< \brief 70, EVR Bandgap and Oscillator Control Register*/
       Ifx_PMS_EVR_OSCCTRL                 OSCCTRL;                /**< \brief 74, EVR Oscillator Control Register*/
} Ifx_PMS_EVR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pms_PMSW_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief PMSW object */
typedef volatile struct _Ifx_PMS_PMSW
{
       Ifx_PMS_PMSW_CR0                    CR0;                    /**< \brief 0, Standby and Wake-up Control Register 0*/
       Ifx_PMS_PMSW_CR2                    CR2;                    /**< \brief 4, Standby and Wake-up Control Register 2*/
       Ifx_UReg_8Bit                       reserved_8[4];          /**< \brief 8, \internal Reserved */
       Ifx_PMS_PMSW_CR3                    CR3;                    /**< \brief C, Standby and Wake-up Control Register 3*/
       Ifx_PMS_PMSW_CR4                    CR4;                    /**< \brief 10, Standby and Wake-up Control Register 4*/
       Ifx_PMS_PMSW_CR5                    CR5;                    /**< \brief 14, Standby and Wake-up Control Register 5*/
       Ifx_UReg_8Bit                       reserved_18[8];         /**< \brief 18, \internal Reserved */
       Ifx_PMS_PMSW_STAT                   STAT;                   /**< \brief 20, Standby and Wake-up Status Register*/
       Ifx_PMS_PMSW_STAT2                  STAT2;                  /**< \brief 24, Standby and Wake-up Status Register 2*/
       Ifx_PMS_PMSW_UTCNT                  UTCNT;                  /**< \brief 28, Standby WUT Counter Register*/
       Ifx_UReg_8Bit                       reserved_2C[8];         /**< \brief 2C, \internal Reserved */
       Ifx_PMS_PMSW_STATCLR                STATCLR;                /**< \brief 34, Standby and Wake-up Status Clear Register*/
} Ifx_PMS_PMSW;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pms_EVRSDCTRL_struct
 * \{  */
/******************************************************************************/
/** \name Object L3
 * \{  */
/** \brief EVRSDCTRL object */
typedef volatile struct _Ifx_PMS_EVRSDCTRL
{
       Ifx_PMS_EVRSDCTRL_CTRL0             CTRL0;                  /**< \brief 0, EVRC SD Control Register 0*/
       Ifx_PMS_EVRSDCTRL_CTRL1             CTRL1;                  /**< \brief 4, EVRC SD Control Register 1*/
       Ifx_PMS_EVRSDCTRL_CTRL2             CTRL2;                  /**< \brief 8, EVRC SD Control Register 2*/
       Ifx_PMS_EVRSDCTRL_CTRL3             CTRL3;                  /**< \brief C, EVRC SD Control Register 3*/
       Ifx_PMS_EVRSDCTRL_CTRL4             CTRL4;                  /**< \brief 10, EVRC SD Control Register 4*/
       Ifx_PMS_EVRSDCTRL_CTRL5             CTRL5;                  /**< \brief 14, EVRC SD Control Register 5*/
       Ifx_PMS_EVRSDCTRL_CTRL6             CTRL6;                  /**< \brief 18, EVRC SD Control Register 6*/
       Ifx_PMS_EVRSDCTRL_CTRL7             CTRL7;                  /**< \brief 1C, EVRC SD Control Register 7*/
       Ifx_PMS_EVRSDCTRL_CTRL8             CTRL8;                  /**< \brief 20, EVRC SD Control Register 8*/
       Ifx_PMS_EVRSDCTRL_CTRL9             CTRL9;                  /**< \brief 24, EVRC SD Control Register 9*/
       Ifx_PMS_EVRSDCTRL_CTRL10            CTRL10;                 /**< \brief 28, EVRC SD Control Register 10*/
       Ifx_PMS_EVRSDCTRL_CTRL11            CTRL11;                 /**< \brief 2C, EVRC SD Control Register 11*/
} Ifx_PMS_EVRSDCTRL;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pms_EVRSDCOEFF_struct
 * \{  */
/******************************************************************************/
/** \name Object L4
 * \{  */
/** \brief EVRSDCOEFF object */
typedef volatile struct _Ifx_PMS_EVRSDCOEFF
{
       Ifx_PMS_EVRSDCOEFF_COEFF0           COEFF0;                 /**< \brief 0, EVRC SD Coefficient Register 0*/
       Ifx_PMS_EVRSDCOEFF_COEFF1           COEFF1;                 /**< \brief 4, EVRC SD Coefficient Register 1*/
       Ifx_PMS_EVRSDCOEFF_COEFF2           COEFF2;                 /**< \brief 8, EVRC SD Coefficient Register 2*/
       Ifx_PMS_EVRSDCOEFF_COEFF3           COEFF3;                 /**< \brief C, EVRC SD Coefficient Register 3*/
       Ifx_PMS_EVRSDCOEFF_COEFF4           COEFF4;                 /**< \brief 10, EVRC SD Coefficient Register 4*/
       Ifx_PMS_EVRSDCOEFF_COEFF5           COEFF5;                 /**< \brief 14, EVRC SD Coefficient Register 5*/
       Ifx_PMS_EVRSDCOEFF_COEFF6           COEFF6;                 /**< \brief 18, EVRC SD Coefficient Register 6*/
       Ifx_PMS_EVRSDCOEFF_COEFF7           COEFF7;                 /**< \brief 1C, EVRC SD Coefficient Register 7*/
       Ifx_PMS_EVRSDCOEFF_COEFF8           COEFF8;                 /**< \brief 20, EVRC SD Coefficient Register 8*/
       Ifx_PMS_EVRSDCOEFF_COEFF9           COEFF9;                 /**< \brief 24, EVRC SD Coefficient Register 9*/
} Ifx_PMS_EVRSDCOEFF;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pms_DTS_struct
 * \{  */
/******************************************************************************/
/** \name Object L5
 * \{  */
/** \brief DTS object */
typedef volatile struct _Ifx_PMS_DTS
{
       Ifx_PMS_DTS_STAT                    STAT;                   /**< \brief 0, Die Temperature Sensor Status Register*/
       Ifx_UReg_8Bit                       reserved_4[4];           /**< \brief 4, \internal Reserved*/
       Ifx_PMS_DTS_LIM                     LIM;                    /**< \brief 8, Die Temperature Sensor Limit Register*/
} Ifx_PMS_DTS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxLld_Pms_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief PMS object */
typedef volatile struct _Ifx_PMS
{
       Ifx_UReg_8Bit                       reserved_0[8];          /**< \brief 0, \internal Reserved */
       Ifx_PMS_ID                          ID;                     /**< \brief 8, Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[32];         /**< \brief C, \internal Reserved */
       Ifx_PMS_EVR                         EVR;                    /**< \brief 2C, */
       Ifx_PMS_EVROSCCTRL2                 EVROSCCTRL2;            /**< \brief A4, EVR Oscillator Control Register 2*/
       Ifx_PMS_EVRBGOCTRL2                 EVRBGOCTRL2;            /**< \brief A8, EVR Bandgap and Oscillator Control Register 2*/
       Ifx_UReg_8Bit                       reserved_AC[8];         /**< \brief AC, \internal Reserved */
       Ifx_PMS_PMSW                        PMSW;                   /**< \brief B4, */
       Ifx_UReg_8Bit                       reserved_EC[16];        /**< \brief EC, \internal Reserved */
       Ifx_PMS_EVRSDSTAT0                  EVRSDSTAT0;             /**< \brief FC, EVR SD Status Register 0*/
       Ifx_UReg_8Bit                       reserved_100[8];        /**< \brief 100, \internal Reserved */
       Ifx_PMS_EVRSDCTRL                   EVRSDCTRL;              /**< \brief 108, EVRC SD Control Register 11*/
       Ifx_UReg_8Bit                       reserved_138[16];       /**< \brief 138, \internal Reserved */
       Ifx_PMS_EVRSDCOEFF                  EVRSDCOEFF;             /**< \brief 148, EVRC SD Coefficient Register 9*/
       Ifx_UReg_8Bit                       reserved_170[80];       /**< \brief 170, \internal Reserved */
       Ifx_PMS_DTS                         DTS;                    /**< \brief 1C0, Die Temperature Sensor Limit Register*/
       Ifx_UReg_8Bit                       reserved_1CC[20];       /**< \brief 1CC, \internal Reserved */
       Ifx_PMS_OTSS                        OTSS;                   /**< \brief 1E0, OCDS Trigger Set Select Register*/
       Ifx_PMS_OTSC0                       OTSC0;                  /**< \brief 1E4, OCDS Trigger Set Control 0 Register*/
       Ifx_PMS_OTSC1                       OTSC1;                  /**< \brief 1E8, OCDS Trigger Set Control 1 Register*/
       Ifx_UReg_8Bit                       reserved_1EC[12];       /**< \brief 1EC, \internal Reserved */
       Ifx_PMS_ACCEN1                      ACCEN1;                 /**< \brief 1F8, Access Enable Register 1*/
       Ifx_PMS_ACCEN0                      ACCEN0;                 /**< \brief 1FC, Access Enable Register 0*/
} Ifx_PMS;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPMS_REGDEF_H */
